Repository: KDE/kfloppy
Catalog: po/*/kfloppy.po
Languages: el, th

source: Floppy &drive:
el: Οδηγός &δισκέτας:
th: ไ&ดรฟ์ฟลอปปี้:

# Primary floppy drive
source: Primary
el: Κύριος
th: ไดรฟ์หลัก (Primary)

# Secondary floppy drive
source: Secondary
el: Δευτερεύων
th: ไดรฟ์รอง (Secondary)

source: <qt>Select the floppy drive.</qt>
el: <qt>Επιλέξτε τον οδηγό δισκέτας.</qt>
th: <qt>เลือกไดรฟ์ของฟลอปปี</qt>

source: &Size:
el: &Χωρητικότητα:
th: &ขนาด:

source: Auto-Detect
el: Αυτόματη ανίχνευση
th: ตรวจสอบอัตโนมัติ

source: 3.5" 1.44MB
th: 3.5" 1.44 เมกะไบต์

source: 3.5" 720KB
th: 3.5" 720 กิโลไบต์

source: 5.25" 1.2MB
th: 5.25" 1.2 เมกะไบต์

source: 5.25" 360KB
th: 5.25" 360 กิโลไบต์

source: <qt>This allows you to select the floppy disk's size and density.</qt>
el: <qt>Αυτό σας επιτρέπει να επιλέξετε το μέγεθος και την πυκνότητα της δισκέτας.</qt>
th: <qt>เลือกขนาดและความจุของแผ่นฟลอปปีของคุณได้ที่นี่</qt>

source: F&ile system:
el: Σύστ&ημα αρχείων:
th: &ระบบแฟ้ม:

# Linux
source: KFloppy supports three file formats under Linux: MS-DOS, Ext2, and Minix
el: Το KFloppy υποστηρίζει τρεις τύπους αρχείου στο Linux: MS-DOS, Ext2 και Minix
th: ฟลอปปี้-K รองรับระบบแฟ้มภายใต้ลินุกซ์สามระบบคือ: แบบดอส (DOS), แบบลินุกซ์ (Ext2), และแบบมินิกซ์ (Minix)

# BSD
source: KFloppy supports three file formats under BSD: MS-DOS, UFS, and Ext2
el: Το KFloppy υποστηρίζει τρεις τύπους αρχείου στο BSD: MS-DOS, UFS και Ext2
th: ฟลอปปี้-K รองรับระบบแฟ้มภายใต้ BSD สามระบบคือ: แบบดอส (DOS), แบบ UFS, และแบบลินุกซ์ (Ext2)

source: DOS
th: แบบดอส (DOS)

# Linux
source: Program mkdosfs found.
el: Το πρόγραμμα mkdosfs βρέθηκε.
th: พบโปรแกรม mkdosfs

# Linux
source: Program mkdosfs <b>not found</b>. MSDOS formatting <b>not available</b>.
el: Το πρόγραμμα mkdosfs <b>δε βρέθηκε</b> .Η διαμόρφωση MSDOS <b>δεν είναι διαθέσιμη</b>.
th: <b>ไม่พบ</b>โปรแกรม mkdosfs การฟอร์แมตแผ่นเป็นแบบดอส (DOS) <b>จะไม่สามารถใช้งานได้</b>

source: ext2
th: แบบลินุกซ์ (ext2)

source: Program mke2fs found.
el: Το πρόγραμμα mke2fs βρέθηκε.
th: พบโปรแกรม mke2fs

source: Program mke2fs <b>not found</b>. Ext2 formatting <b>not available</b>
el: Το πρόγραμμα mke2fs <b>δε βρέθηκε</b>. Η διαμόρφωση Ext2 <b>δεν είναι διαθέσιμη</b>
th: <b>ไม่พบ</b>โปรแกรม mke2fs การฟอร์แมตแผ่นเป็นแบบลินุกซ์ (Ext2) <b>จะไม่สามารถใช้งานได้</b>

source: Minix
th: แบบมินิกซ์ (Minix)

# Linux
source: Program mkfs.minix found.
el: Το πρόγραμμα mkfs.minix βρέθηκε.
th: พบโปรแกรม mkfs.minix

# Linux
source: Program mkfs.minix <b>not found</b>. Minix formatting <b>not available</b>
el: Το πρόγραμμα mkfs.minix <b>δε βρέθηκε</b>. Η διαμόρφωση Minix <b>δεν είναι διαθέσιμη</b>
th: <b>ไม่พบ</b>โปรแกรม mkfs.minix การฟอร์แมตแผ่นเป็นแบบมินิกซ์ (Minix) <b>จะไม่สามารถใช้งานได้</b>

# BSD
source: KFloppy supports two file formats under BSD: MS-DOS and UFS
el: Το KFloppy υποστηρίζει δύο τύπους αρχείου στο BSD: MS-DOS και UFS
th: ฟลอปปี้-K รองรับระบบแฟ้มภายใต้ BSD สองระบบคือ: แบบดอส (DOS) และแบบ UFS

# BSD
source: Program newfs_msdos found.
el: Το πρόγραμμα newfs_msdos βρέθηκε.
th: พบโปรแกรม newfs_msdos

# BSD
source: Program newfs_msdos <b>not found</b>. MSDOS formatting <b>not available</b>.
el: Το πρόγραμμα newfs_msdos <b>δε βρέθηκε</b>. Η διαμόρφωση MSDOS <b>δεν είναι διαθέσιμη</b>.
th: <b>ไม่พบ</b>โปรแกรม newfs_msdos การฟอร์แมตแผ่นเป็นแบบดอส (DOS) <b>จะไม่สามารถใช้งานได้</b>

source: UFS
th: แบบ UFS

# BSD
source: Program newfs found.
el: Το πρόγραμμα newfs βρέθηκε.
th: พบโปรแกรม newfs

# BSD
source: Program newfs <b>not found</b>. UFS formatting <b>not available</b>.
el: Το πρόγραμμα newfs <b>δε βρέθηκε</b>. Η διαμόρφωση UFS <b>δεν είναι διαθέσιμη</b>.
th: <b>ไม่พบ</b>โปรแกรม newfs การฟอร์แมตแผ่นเป็นแบบ UFS <b>จะไม่สามารถใช้งานได้</b>

source: &Formatting
el: Διαμόρ&φωση
th: การ&ฟอร์แมต

source: Q&uick format
el: Γ&ρήγορη διαμόρφωση
th: ฟอร์แมตแบบเ&ร็ว

source: <qt>Quick format is only a high-level format: it creates only a file system.</qt>
el: <qt>Η Γρήγορη διαμόρφωση είναι διαμόρφωση υψηλού επιπέδου: απλώς δημιουργεί ένα σύστημα αρχείων.</qt>
th: <qt>การฟอร์แมตแบบเร็วจะเป็นการฟอร์แมตระดับสูงเท่านั้น ซึ่งจะทำเพียงสร้างระบบแฟ้ม</qt>

source: &Zero out and quick format
el: Πλήρης δια&γραφή και γρήγορη διαμόρφωση
th: เขียนทุกส่วนด้วยค่าศู&นย์ และฟอร์แมตแบบเร็ว

source: <qt>This first erases the floppy by writing zeros and then it creates the file system.</qt>
el: <qt>Αυτό πρώτα σβήνει τη δισκέτα γράφοντας μηδενικά και στη συνέχεια δημιουργεί το σύστημα αρχείων.</qt>
th: <qt>จะเป็นการลบข้อมูลออกจากแผ่นฟลอปปี้และเขียนค่าศูนย์ลงไปในพื้นที่ จากนั้นจึงสร้างระบบแฟ้ม</qt>

source: Fu&ll format
el: Π&λήρης διαμόρφωση
th: ฟอร์แมตเ&ต็มรูปแบบ

source: Full format is a low-level and high-level format. It erases everything on the disk.
el: Η πλήρης διαμόρφωση είναι διαμόρφωση χαμηλού επιπέδου και υψηλού επιπέδου. Διαγράφει τα πάντα στη δισκέτα.
th: การฟอร์แมตเต็มรูปแบบจะทำได้ทั้งแบบฟอร์แมตระดับต่ำ และฟอร์แมตระดับสูง ซึ่งจะมีการลบข้อมูลทั้งหมดที่อยู่ในแผ่นดิสก์ทิ้ง

source: Program fdformat found.
el: Το πρόγραμμα fdformat βρέθηκε.
th: พบโปรแกรม fdformat

source: Program fdformat <b>not found</b>. Full formatting <b>disabled</b>.
el: Το πρόγραμμα fdformat <b>δε βρέθηκε</b>. Η πλήρης διαμόρφωση <b>απενεργοποιήθηκε</b>.
th: <b>ไม่พบ</b>โปรแกรม fdformat การฟอร์แมตแผ่นเต็มรูปแบบ<b>จะไม่สามารถใช้งานได้</b>

source: Program dd found.
el: Το πρόγραμμα dd βρέθηκε.
th: พบโปรแกรม dd

source: Program dd <b>not found</b>. Zeroing-out <b>disabled</b>.
el: Το πρόγραμμα dd <b>δε βρέθηκε</b>. Η πλήρης διαγραφή <b>απενεργοποιήθηκε</b>.
th: <b>ไม่พบ</b>โปรแกรม dd การฟอร์แมตโดยการเขียนค่าศูนย์ทับ<b>จะไม่สามารถใช้งานได้</b>

source: &Verify integrity
el: &Επαλήθευση ακεραιότητας
th: &ตรวจสอบความถูกต้อง

source: <qt>Check this if you want the floppy disk to be checked after formatting. Please note that the floppy will be checked twice if you have selected full formatting.</qt>
el: <qt>Επιλέξτε το αν θέλετε να γίνει έλεγχος της δισκέτας μετά τη διαμόρφωσή της. Παρακαλώ σημειώστε ότι η δισκέτα θα ελεγχθεί δύο φορές αν επιλέξατε πλήρη διαμόρφωση.</qt>
th: <qt>เปิดใช้ตัวเลือกนี้หากคุณต้องการให้มีการตรวจสอบความถูกต้องของแผ่นหลังจากทำการฟอร์แมตเรียบร้อยแล้ว หากเลือกฟอร์แมตเป็นแบบเต็มรูปแบบจะทำให้มีการตรวจสอบแผ่นสองครั้ง</qt>

source: Volume la&bel:
el: &Ετικέτα δισκέτας:
th: ป้ายชื่อของแ&ผ่น:

source: <qt>Check this if you want a volume label for your floppy. Please note that Minix does not support labels at all.</qt>
el: <qt>Ελέγξτε αν θέλετε ετικέτα στη δισκέτα σας. Παρακαλώ σημειώστε ότι το Minix δεν υποστηρίζει καθόλου ετικέτες</qt>
th: <qt>ใช้ตัวเลือกนี้หากต้องการกำหนดชื่อให้กับแผ่นดิสก์ แต่ในรูปแบบมินิกซ์ (Minix) จะไม่รองรับการตั้งชื่อให้แผ่น</qt>

# Volume label, maximal 11 characters
source: KDE Floppy
el: Δισκέτα KDE
th: ฟลอปปี้-K

source: <qt>This is for the volume label. Due to a limitation of MS-DOS the label can only be 11 characters long. Please note that Minix does not support labels, whatever you enter here.</qt>
el: <qt>Αυτό είναι για την ετικέτα της δισκέτας. Σύμφωνα με τους περιορισμούς του DOS η ετικέτα μπορεί να έχει μέχρι 11 χαρακτήρες. Παρακαλώ σημειώστε ότι το Minix δεν υποστηρίζει ετικέτες ή οτιδήποτε εισάγετε εδώ.</qt>
th: <qt>นี่เป็นชื่อของแผ่นโดยมีความยาวของชื่อได้ 11 ตัวอักษรตามข้อจำกัดของระบบดอส แต่ชื่อแผ่นนี้จะไม่สามารถใช้งานได้กับระบบมินิกซ์</qt>

source: &Format
el: Διαμόρ&φωση
th: &ฟอร์แมต

source: <qt>Click here to start formatting.</qt>
el: <qt>Κάντε κλικ εδώ για να ξεκινήσει η διαμόρφωση.</qt>
th: <qt>คลิกเพื่อเริ่มทำการฟอร์แมตที่นี่</qt>

source: <qt>This is the status window, where error messages are displayed.</qt>
el: <qt>Αυτό είναι το παράθυρο κατάστασης, όπου εμφανίζονται τα μηνύματα σφάλματος.</qt>
th: <qt>นี่เป็นกล่องแสดงสถานะ โดยใช้แสดงข้อความผิดพลาด</qt>

source: <qt>Shows progress of the format.</qt>
el: <qt>Εμφανίζει την πρόοδο της διαμόρφωσης.</qt>
th: <qt>แสดงความคืบหน้าของการฟอร์แมต</qt>

source: KFloppy cannot find any of the needed programs for creating file systems; please check your installation.<br /><br />Log:
el: Το KFloppy δεν μπορεί να βρει κανένα από τα απαιτούμενα προγράμματα για την δημιουργία συστημάτων αρχείων. Παρακαλώ ελέγξτε την εγκατάσταση.<br /><br />Καταγραφή:
th: โปรแกรมฟลอปปี้-K ไม่พบโปรแกรมต่าง ๆ ที่จำเป็นต้องใช้งานในการสร้างระบบแฟ้ม โปรดตรวจสอบการติดตั้งโปรแกรม<br /><br />ปูมบันทึก:

source: KDE Floppy Formatter
el: Διαμορφωτής δισκέτας του KDE
th: เครื่องมือฟอร์แมตแผ่นฟลอปปี้ของ KDE

# BSD
source: Formatting with BSD on a user-given device is only possible with UFS
el: Η διαμόρφωση με BSD σε μία συσκευή του χρήστη είναι μόνο με UFS
th: การทำการฟอร์แมตด้วยระบบ BSD บนอุปกรณ์ที่กำหนดมาจะฟอร์แมตได้ในรูปแบบ UFS เท่านั้น

source: <qt>Formatting will erase all data on the device:<br/><b>%1</b><br/>(Please check the correctness of the device name.)<br/>Are you sure you wish to proceed?</qt>
el: <qt>Η διαμόρφωση θα σβήσει όλα τα δεδομένα στη συσκευή:<br/><b>%1</b><br/>(Παρακαλώ ελέγξτε την ορθότητα του ονόματος της συσκευής)<br/> Σίγουρα θέλετε να συνεχίσετε;</qt>
th: <qt>การฟอร์แมตจะมีการลบข้อมูลทั้งหมดในแผ่นดิสก์: <br /><b>%1</b> <br />(โปรดตรวจสอบด้วยว่าชื่ออุปกรณ์ถูกต้องหรือไม่)<br />คุณแน่ใจว่าต้องการจะฟอร์แมตจริงหรือไม่ ?</qt>

source: Proceed?
el: Συνέχεια;
th: ฟอร์แมตหรือไม่ ?

source: Full formatting of a user-given device is not possible.
el: Η πλήρης διαμόρφωση σε μία συσκευή του χρήστη δεν είναι δυνατή.
th: การทำการฟอร์แมตแบบเต็มรูปแบบของอุปกรณ์ที่ผู้ใช้กำหนดมา เป็นไปไม่ได้

source: Formatting will erase all data on the disk. Are you sure you wish to proceed?
el: Η διαμόρφωση θα σβήσει όλα τα δεδομένα στη δισκέτα. Σίγουρα θέλετε να συνεχίσετε;
th: การฟอร์แมตจะมีการลบข้อมูลทั้งหมดในแผ่นดิสก์ คุณแน่ใจว่าต้องการจะฟอร์แมตจริงหรือไม่ ?

source: Unexpected drive number %1.
el: Μη αναμενόμενος αριθμός οδηγού %1.
th: ได้รับค่าไดรฟ์ %1 ที่ไม่คาดหมาย

source: Unexpected density number %1.
el: Μη αναμενόμενος αριθμός πυκνότητας %1.
th: ได้รับค่าความจุ %1 ที่ไม่คาดหมาย

source: Cannot find a device for drive %1 and density %2.
el: Αδύνατη η εύρεση συσκευής για τον οδηγό %1 και την πυκνότητα %2.
th: ไม่พบอุปกรณ์สำหรับไดรฟ์ %1 โดยมีความจุ %2

source: Cannot access %1 Make sure that the device exists and that you have write permission to it.
el: Αδύνατη η προσπέλαση του %1 Βεβαιωθείτε ότι η συσκευή υπάρχει και ότι έχετε άδεια εγγραφής σε αυτήν.
th: ไม่สามารถเข้าถึง %1 ได้ โปรดตรวจสอบว่ามีอุปกรณ์นี้อยู่ และคุณมีสิทธิที่จะเขียนไปยังมัน

source: The program %1 terminated with an error.
el: Το πρόγραμμα %1 τερματίστηκε με σφάλμα.
th: โปรแกรม %1 ยุติการทำงานโดยมีข้อผิดพลาด

source: The program %1 terminated abnormally.
el: Το πρόγραμμα %1 τερματίστηκε ανώμαλα.
th: โปรแกรม %1 ยุติการทำงานอย่างผิดปกติ

source: Internal error: device not correctly defined.
el: Εσωτερικό σφάλμα: Η συσκευή δε δηλώθηκε σωστά.
th: ข้อผิดพลาดภายใน: การกำหนดอุปกรณ์ยังไม่ถูกต้อง

source: Cannot find fdformat.
el: Αδύνατο να βρεθεί το fdformat.
th: ไม่พบคำสั่ง fdformat

source: Could not start fdformat.
el: Αδύνατη η εκκίνηση του fdformat.
th: ไม่สามารถเรียกคำสั่ง fdformat ได้

source: Error formatting track %1.
el: Σφάλμα διαμόρφωσης διαδρομής %1.
th: เกิดข้อผิดพลาดขณะฟอร์แมตแทร็ก %1

source: Cannot access floppy or floppy drive. Please insert a floppy and make sure that you have selected a valid floppy drive.
el: Αδύνατη η πρόσβαση στη δισκέτα ή στον οδηγό δισκέτας Παρακαλώ εισάγετε μια δισκέτα και βεβαιωθείτε ότι έχετε επιλέξει έναν έγκυρο οδηγό δισκέτας.
th: ไม่สามารถเข้าถึงแผ่นฟลอปปีหรือไดรฟ์ฟลอปปี้ได้ โปรดใส่แผ่นฟลอปปี้และตรวจสอบว่า คุณเลือกไดรฟ์ฟลอปปี้ที่ถูกต้องแล้ว

source: Low-level formatting error at track %1.
el: Σφάλμα χαμηλού επιπέδου διαμόρφωσης στη διαδρομή %1.
th: การฟอร์แมตระดับต่ำผิดพลาดที่แทร็ก %1

source: Low-level formatting error: %1
el: Σφάλμα διαμόρφωσης διαδρομής: %1
th: การฟอร์แมตระดับต่ำผิดพลาด: %1

source: Device busy. Perhaps you need to unmount the floppy first.
el: Η συσκευή είναι απασχολημένη. Ίσως πρέπει πρώτα να αποπροσαρτήσετε τη δισκέτα.
th: อุปกรณ์ยังทำงานอยู่ บางทีคุณอาจจะต้องทำการยกเลิกการเมานท์ฟลอปปี้ก่อน

source: Low-level format error: %1
el: Σφάλμα διαμόρφωσης διαδρομής: %1
th: การฟอร์แมตระดับต่ำผิดพลาด: %1

source: Cannot find dd.
el: Αδύνατο να βρεθεί το dd.
th: ไม่พบคำสั่ง dd

source: Could not start dd.
el: Αδύνατη η εκκίνηση του dd.
th: ไม่สามารถเรียกใช้โปรแกรม dd ได้

source: Cannot find a program to create FAT filesystems.
el: Αδύνατη η εύρεση ενός προγράμματος για τη δημιουργία συστημάτων αρχείων FAT.
th: ไม่พบโปรแกรมสำหรับใช้สร้างระบบแฟ้มแบบ FAT

source: Cannot start FAT format program.
el: Αδύνατη η εκκίνηση του προγράμματος διαμόρφωσης FAT.
th: ไม่สามารถเรียกใช้โปรแกรมฟอร์แมตรูปแบบ FAT ได้

source: Floppy is mounted. You need to unmount the floppy first.
el: Η δισκέτα είναι προσαρτημένη. Πρέπει να την αποπροσαρτήσετε πρώτα.
th: แผ่นฟลอปปี้ถูกเมานท์อยู่ คุณต้องทำการยกเลิกการเมานท์แผ่นฟลอปปี้ก่อน

# BSD
source: Cannot find a program to create UFS filesystems.
el: Αδύνατη η εύρεση ενός προγράμματος για τη δημιουργία συστημάτων αρχείων UFS.
th: ไม่พบโปรแกรมสำหรับใช้สร้างระบบแฟ้มแบบ UFS

# BSD
source: Cannot start UFS format program.
el: Αδύνατη η εκκίνηση του προγράμματος διαμόρφωσης UFS.
th: ไม่สามารถเรียกใช้โปรแกรมฟอร์แมตแบบ UFS ได้

source: Cannot find a program to create ext2 filesystems.
el: Αδύνατη η εύρεση ενός προγράμματος για τη δημιουργία συστημάτων αρχείων ext2.
th: ไม่พบโปรแกรมสำหรับใช้สร้างระบบแฟ้มแบบลินุกซ์ (ext2)

source: Cannot start ext2 format program.
el: Αδύνατη η εκκίνηση του προγράμματος διαμόρφωσης ext2.
th: ไม่สามารถเรียกใช้โปรแกรมฟอร์แมตแบบลินุกซ์ (ext2) ได้

source: Cannot find a program to create Minix filesystems.
el: Αδύνατη η εύρεση ενός προγράμματος για τη δημιουργία συστημάτων αρχείων Minix.
th: ไม่พบโปรแกรมสำหรับใช้สร้างระบบแฟ้มแบบมินิกซ์ (Minix)

source: Cannot start Minix format program.
el: Αδύνατη η εκκίνηση του προγράμματος διαμόρφωσης Minix.
th: ไม่สามารถเรียกใช้โปรแกรมฟอร์แมตแบบมินิกซ์ (Minix) ได้

source: KFloppy
th: ฟลอปปี้-K

source: KDE Floppy Disk Utility
el: Εργαλείο δισκετών για το KDE
th: เครื่องมือฟอร์แมตแผ่นฟลอปปี้ของ KDE

source: KFloppy helps you format floppies with the filesystem of your choice.
el: Το KFloppy σας βοηθά να διαμορφώσετε δισκέτες με το σύστημα αρχείων της επιλογής σας.
th: โปรแกรมฟลอปปี้-K, ช่วยคุณในการฟอร์แมตแผ่นฟลอปปี้เป็นระบบแฟ้มตามที่คุณกำหนด

source: Author and former maintainer
el: Συγγραφέας και προηγούμενος συντηρητής
th: ผู้เขียนและผู้ดูแลอย่างเป็นทางการ

source: User interface re-design
el: Επανασχεδιασμός περιβάλλοντος χρήστη
th: ออกแบบส่วนติดต่อผู้ใช้ตัวใหม่

source: Add BSD support
el: Προσθήκη υποστήριξης BSD
th: เพิ่มส่วนรองรับระบบ BSD

source: Make KFloppy work again for KDE 3.4
el: Έκανε το KFloppy να δουλέψει ξανά για το KDE 3.4
th: ทำให้ฟลอปปี้-K ใช้งานได้อีกครั้งบน KDE 3.4

# NAME OF TRANSLATORS
source: Your names
el: Σπύρος Γεωργαράς, Τούσης Μανώλης
th: ถนอมทรัพย์ นพบูรณ์

# EMAIL OF TRANSLATORS
source: Your emails
el: sng@hellug.gr, manolis@koppermind.homelinux.org
th: donga.nb@gmail.com

source: Default device
el: Προκαθορισμένη συσκευή
th: อุปกรณ์ปริยาย

source: Port KFloppy to KF5
el: Μεταφορά KFloppy στο KF5
